{
  "resourceType": "Profile",
  "text": {
    "status": "generated",
    "div": "<div><div>Type definition for ResourceReference from <a href=\"http://hl7.org/fhir/datatypes.html#ResourceReference\">FHIR Specification</a></div></div>"
  },
  "name": "Basic Profile for ResourceReference",
  "publisher": "FHIR Specification",
  "description": "Basic Profile for ResourceReference for validation support",
  "status": "draft",
  "date": "2014-10-08",
  "mapping": [
    {
      "identity": "rim",
      "uri": "http://hl7.org/v3",
      "name": "RIM"
    }
  ],
  "structure": [
    {
      "type": "ResourceReference",
      "element": [
        {
          "path": "ResourceReference",
          "definition": {
            "short": "A reference from one resource to another",
            "formal": "A reference from one resource to another.",
            "min": 1,
            "max": "1",
            "type": [
              {
                "code": "Type"
              }
            ],
            "constraint": [
              {
                "key": "1",
                "name": "Inline",
                "severity": "error",
                "human": "SHALL have a local reference if the resource is provided inline",
                "xpath": "not(starts-with(f:reference/@value, '#')) or exists(ancestor::a:content/f:*/f:contained/f:*[@id=substring-after(current()/f:reference/@value, '#')]|/f:*/f:contained/f:*[@id=substring-after(current()/f:reference/@value, '#')])"
              }
            ],
            "isModifier": false,
            "mapping": [
              {
                "identity": "rim",
                "map": "The target of a resource reference is a RIM entry point (Act, Role, or Entity)"
              }
            ]
          }
        },
        {
          "path": "ResourceReference.extension",
          "definition": {
            "short": "Additional Content defined by implementations",
            "formal": "May be used to represent additional information that is not part of the basic definition of the resource. In order to make the use of extensions safe and manageable, there is a strict governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
            "comments": "there can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core simplicity for everyone.",
            "synonym": [
              "extensions",
              "user content"
            ],
            "min": 0,
            "max": "*",
            "type": [
              {
                "code": "Extension"
              }
            ],
            "isModifier": false
          }
        },
        {
          "path": "ResourceReference.modifierExtension",
          "definition": {
            "short": "Extensions that cannot be ignored",
            "formal": "May be used to represent additional information that is not part of the basic definition of the resource, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.",
            "comments": "there can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core simplicity for everyone.",
            "synonym": [
              "extensions",
              "user content"
            ],
            "min": 0,
            "max": "*",
            "type": [
              {
                "code": "Extension"
              }
            ],
            "isModifier": false
          }
        },
        {
          "path": "ResourceReference.reference",
          "definition": {
            "short": "Relative, internal or absolute URL reference",
            "formal": "A reference to a location at which the other resource is found. The reference may a relative reference, in which case it is relative to the service base URL, or an absolute URL that resolves to the location where the resource is found. The reference may be version specific or not. If the reference is not to a FHIR RESTful server, then it should be assumed to be version specific. Internal fragment references (start with '#') refer to contained resources.",
            "comments": "Using absolute URLs provides a stable scalable approach suitable for a cloud/web context, while using relative/logical references provides a flexible approach suitable for use when trading across closed eco-system boundaries. \n\nAbsolute URLs do not need to point to a FHIR RESTful server, though this is the preferred approach. If the url conforms to the structure \"/[type]/@[id]\" then it should be assumed that the reference is to a FHIR RESTful server.",
            "min": 0,
            "max": "1",
            "type": [
              {
                "code": "string"
              }
            ],
            "isModifier": false,
            "mapping": [
              {
                "identity": "rim",
                "map": "N/A"
              }
            ]
          }
        },
        {
          "path": "ResourceReference.display",
          "definition": {
            "short": "Text alternative for the resource",
            "formal": "Plain text narrative that identifies the resource in addition to the resource reference.",
            "comments": "This is generally not the same as the Resource.text of the referenced resource.  The purpose is to identify what's being referenced, not to fully describe it.",
            "min": 0,
            "max": "1",
            "type": [
              {
                "code": "string"
              }
            ],
            "isModifier": false,
            "mapping": [
              {
                "identity": "rim",
                "map": "N/A"
              }
            ]
          }
        }
      ]
    }
  ]
}